apache/nuttx/arch/risc-v/src/hpm6750/hpm6750_serial.c
static void up_serialout(struct up_dev_s *priv, int offset, uint32_t value)
{
  putreg32(value, priv->uartbase + offset);
}

/****************************************************************************
 * Name: up_serialmodify
 ****************************************************************************/

static void up_serialmodfiy(struct up_dev_s *priv, int offset,
                            uint32_t clearbits, uint32_t setbits)
{
  modifyreg32(priv->uartbase + offset, clearbits, setbits);
}

/****************************************************************************
 * Name: up_restoreuartint
 ****************************************************************************/

static void up_restoreuartint(struct up_dev_s *priv, uint8_t im)
{
  irqstate_t flags = spin_lock_irqsave(&priv->lock);

  priv->im = im;
  up_serialout(priv, UART_IER_OFFSET, im);

  spin_unlock_irqrestore(&priv->lock, flags);
}

/****************************************************************************
 * Name: up_disableuartint
 ****************************************************************************/

static void up_disableuartint(struct up_dev_s *priv, uint8_t *im)
{
  irqstate_t flags = spin_lock_irqsave(&priv->lock);

  /* Return the current interrupt mask value */

  if (im)
    {
     *im = priv->im;
    }

  /* Disable all interrupts */

  priv->im = 0;
  up_serialout(priv, UART_IER_OFFSET, 0);
  spin_unlock_irqrestore(&priv->lock, flags);
}

/****************************************************************************
 * Name: hpm6750_init_uart_pins
 ****************************************************************************/

static void hpm6750_init_uart_pins(struct up_dev_s *priv)
{
  if (priv->uartbase == HPM6750_UART0_BASE)
    {
      putreg32(IOC_PY06_FUNC_CTL_UART0_TXD, IOC_PAD_PY06_FUNC_CTL);
      putreg32(IOC_PY07_FUNC_CTL_UART0_RXD, IOC_PAD_PY07_FUNC_CTL);
      putreg32(IOC_PY06_FUNC_CTL_SOC_PY_06, PIOC_PAD_PY06_FUNC_CTL);
      putreg32(IOC_PY07_FUNC_CTL_SOC_PY_07, PIOC_PAD_PY07_FUNC_CTL);
    }
}

/****************************************************************************
 * Name: hpm6750_uart_calculate_baudrate
 ****************************************************************************/

#define HPM_UART_MINIMUM_BAUDRATE (200U)
#define HPM_UART_BAUDRATE_TOLERANCE (3)
#define HPM_UART_OSC_MAX (32U)
#define HPM_UART_OSC_MIN (8U)
#define HPM_UART_BAUDRATE_DIV_MAX (0xFFFFU)
#define HPM_UART_BAUDRATE_DIV_MIN (1U)

static bool hpm6750_uart_calculate_baudrate(uint32_t freq, uint32_t baudrate,
                                         uint16_t *div_out, uint8_t *osc_out)
{
  uint16_t div;
  uint16_t osc;
  uint16_t delta;
  float tmp;

  if ((div_out == NULL) || (!freq) || (!baudrate)
    || (baudrate < HPM_UART_MINIMUM_BAUDRATE)
    || (freq / HPM_UART_BAUDRATE_DIV_MIN < baudrate * HPM_UART_OSC_MIN)
    || (freq / HPM_UART_BAUDRATE_DIV_MAX > (baudrate * HPM_UART_OSC_MAX)))
    {
      return 0;
    }

  tmp = (float) freq / baudrate;
  for (uint8_t i = 0; i < HPM_UART_OSC_MAX; i += 2)
    {
      /* osc range: 0 - 32, even number */

      if (i == 0)
        {
          /* osc == 0 in bitfield, oversample rate is 32 */

          osc = HPM_UART_OSC_MAX;
        }
      else if (i <= 8)
        {
          /* osc <= 8 in bitfield, oversample rate is 8 */

          osc = HPM_UART_OSC_MIN;
        }
      else
        {
          /* osc > 8 && osc < 32 in bitfield, oversample rate is osc */

          osc = i;
        }

      delta = 0;
      div = (uint16_t)(tmp / osc);
      if (div < HPM_UART_BAUDRATE_DIV_MIN)
        {
          /* invalid div */

          continue;
        }

      if (div * osc > tmp)
        {
          delta = div * osc - tmp;
        }
      else if (div * osc < tmp)
        {
          delta = tmp - div * osc;
        }
      else
        {
          /* Do Nothing */
        }

      if (delta && ((delta * 100 / tmp) > HPM_UART_BAUDRATE_TOLERANCE))
        {
          continue;
        }
      else
        {
          *div_out = div;
          *osc_out = (i <= 8 && i) ? osc : i;
          return true;
        }
    }

  return false;
}

/****************************************************************************
 * Name: hpm6750_uart_modem_config
 ****************************************************************************/

static void hpm6750_uart_modem_config(struct up_dev_s *priv,
                                     uart_modem_config_t *config)
{
  uint32_t value;

  value = UART_MCR_AFE_SET(config->auto_flow_ctrl_en)
        | UART_MCR_LOOP_SET(config->loop_back_en)
        | UART_MCR_RTS_SET(!config->set_rts_high);

  up_serialout(priv, UART_MCR_OFFSET, value);
}

/****************************************************************************
 * Name: hpm6750_uart_init
 ****************************************************************************/

static void hpm6750_uart_init(struct up_dev_s *priv)
{
  uint32_t tmp;
  uint8_t osc;
  uint16_t div;
  uart_config_t *config;

  config = &priv->config;

  /* disable all interrupts */

  up_serialout(priv, UART_IER_OFFSET, 0);

  /* Set DLAB to 1 */

  up_serialmodfiy(priv, UART_LCR_OFFSET, 0, UART_LCR_DLAB_MASK);

  (void)hpm6750_uart_calculate_baudrate(config->src_freq_in_hz,
                                        config->baudrate, &div, &osc);

  up_serialmodfiy(priv, UART_OSCR_OFFSET,
                  UART_OSCR_OSC_MASK, UART_OSCR_OSC_SET(osc));
  up_serialout(priv, UART_DLL_OFFSET, UART_DLL_DLL_SET(div >> 0));
  up_serialout(priv, UART_DLM_OFFSET, UART_DLM_DLM_SET(div >> 8));

  /* DLAB bit needs to be cleared once baudrate is configured */

  up_serialmodfiy(priv, UART_LCR_OFFSET, UART_LCR_DLAB_MASK, 0);

  tmp = up_serialin(priv, UART_LCR_OFFSET);
  tmp &= ~(UART_LCR_SPS_MASK | UART_LCR_EPS_MASK | UART_LCR_PEN_MASK);
  switch (config->parity)
    {
      case parity_none:
        break;
      case parity_odd:
        tmp |= UART_LCR_PEN_MASK;
        break;
      case parity_even:
        tmp |= UART_LCR_PEN_MASK | UART_LCR_EPS_MASK;
        break;
      case parity_always_1:
        tmp |= UART_LCR_PEN_MASK | UART_LCR_SPS_MASK;
        break;
      case parity_always_0:
        tmp |= UART_LCR_EPS_MASK | UART_LCR_PEN_MASK | UART_LCR_SPS_MASK;
        break;
      default:
        break;
    }

  tmp &= ~UART_LCR_STB_MASK;
  switch (config->num_of_stop_bits)
    {
      case stop_bits_1:
        break;
      case stop_bits_1_5:
      case stop_bits_2:
        tmp |= UART_LCR_STB_MASK;
        break;
      default:
        break;
    }

  tmp &= ~UART_LCR_WLS_MASK;
  tmp |= UART_LCR_WLS_SET(config->word_length);
  up_serialout(priv, UART_LCR_OFFSET, tmp);
  up_serialout(priv, UART_FCR_OFFSET,
               UART_FCR_TFIFORST_MASK | UART_FCR_RFIFORST_MASK);
  if (config->fifo_enable)
    {
      /* Enable FIFO, reset TX and RX. */

      tmp = UART_FCR_TFIFORST_MASK
          | UART_FCR_RFIFORST_MASK | UART_FCR_FIFOE_MASK
          | UART_FCR_TFIFOT_SET(config->tx_fifo_level)
          | UART_FCR_RFIFOT_SET(config->rx_fifo_level)
          | UART_FCR_DMAE_SET(config->dma_enable);
      up_serialout(priv, UART_FCR_OFFSET, tmp);
    }

  hpm6750_uart_modem_config(priv, &config->modem_config);
}

/****************************************************************************
 * Name: up_setup
 *
 * Description:
 *   Configure the UART baud, bits, parity, etc. This method is called the
 *   first time that the serial port is opened.
 *
 ****************************************************************************/

